//Task1

//Объявляем первую переменную
let admin;
//Объявляем вторую переменную
let name;
//Заполняем первую переменную
name = 'Джон';
//Копируем её во вторую
admin = name;
//Вывод
alert(admin);

//Task2
let homeName;
let currentUser;

//Task3
//Объявляем переменную
let a;
//Присваиваем ей значение
a = '10' + 10;
//Проверяем
console.log(typeof(a));
//Единственный логически верный способ записать в память компьютера выражение, сохранив сразу обе переменные, - это дать
//ему строчный тип. Поэтому так всё работает.
